Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/care_in_your_community/speech_and_language_therapy_services.html.txt.tmx
Source language: en
Languages: ga

source: Speech and language therapy services
ga: Seirbhísí teiripe urlabhra agus teanga

source: The public health service may provide a speech and language therapy service to people with communication difficulties
ga: Féadfaidh an tseirbhís sláinte poiblí seirbhís teiripe urlabhra agus teanga a chur ar fáil do dhaoine a bhfuil deacrachtaí cumarsáide acu

source: These services may be provided by the Health Service Executive (HSE) and delivered by speech and language therapists
ga: Is í Feidhmeannacht na Seirbhíse Sláinte a sholáthraíonn na seirbhísí sin agus is speisialtóirí maidir le neamhoird chumarsáide a chuireann ar fáil iad

source: Speech and language therapists assess, diagnose, and treat people with communication difficulties in a wide variety of settings including local health centres, hospitals and schools
ga: ‘Teiripeoirí urlabhra agus teanga’ a thugtar ar speisialtóirí ó thaobh neamhord cumarsáide. Déanann na teiripeoirí sin measúnú ar dhaoine a bhfuil deacrachtaí cumarsáide acu, déanann diagnóisí agus cuireann cóireáil orthu

source: Therapy services help people with speech, language, fluency, voice and swallowing difficulties
ga: Is iomaí áit ina ndéanann siad an obair sin, lena n-áirítear ionaid sláinte, ospidéil agus scoileanna

source: Some people may fail to access education, social, economic and career opportunities due to communication difficulties of one kind or another
ga: Tá daoine ann a dteipeann orthu deiseanna oideachais, sóisialta, eacnamaíochta agus gairme a thapú de bharr deacrachtaí éagsúla cumarsáide

source: Therapy services help people to maximise their communication potential and can help with daily living
ga: Cabhraíonn na seirbhísí teiripe le daoine uasmhéadú a dhéanamh ar a gcumas cumarsáide agus cabhraíonn siad leo ó lá go lá

source: Speech and language therapy services may be available to people with communication difficulties through Local Health Offices or voluntary organisations on contract to the HSE
ga: D’fhéadfadh teiripe urlabhra agus teanga a bheith á cur ar fáil do dhaoine a bhfuil deacrachtaí cumarsáide acu ag Oifigí Sláinte Áitiúla nó ag eagraíochtaí deonacha nó féadfar dul i dteagmháil le FSS faoin scéal

source: Public health speech and language therapy services are free and, in most areas, priority is given to children
ga: Cuirtear na seirbhísí sláinte poiblí teiripe urlabhra agus teanga ar fáil saor in aisce, agus tugtar tús áite do leanaí i bhformhór na limistéar

source: The service may be provided in schools or in health centres or clinics
ga: Féadfar an tseirbhís a chur ar fáil i scoileanna nó in ionaid sláinte nó i gclinicí

source: Adults may also avail of speech and language therapy services if referred by their family doctor (GP), public health nurse or as part of combined care provided in public hospitals
ga: Féadfaidh daoine fásta leas a bhaint as seirbhísí teiripe urlabhra agus teanga má dhéanann dochtúir teaghlaigh nó altra sláinte poiblí iad a atreorú chucu, nó féadfaidh siad na seirbhísí a fháil mar chuid de chúram comhcheangailte in ospidéil

source: Priority is given to adults who have a speech and language disability that has been caused by a stroke, accident or a progressive neurological disorder
ga: Tabharfar tosaíocht duit mar dhuine fásta má tá míchumas urlabhra nó teanga agat de bharr stróc, timpiste nó neamhord forchéimnitheach néareolaíoch

source: Speech and language therapy services provided through the public health service are free of charge
ga: Seirbhísí saor in aisce iad na seirbhísí teiripe urlabhra agus teanga a chuireann an tseirbhís sláinte poiblí ar fáil

source: You have to pay for private services
ga: Caithfidh tú íoc as seirbhísí príobháideacha

source: However, you may be able to claim tax relief on medical expenses
ga: Mar sin féin, d’fhéadfá a bheith in ann faoiseamh cánach a éileamh

source: Contact your Local Health Office for information on services in your area
ga: Téigh i dteagmháil le d’Oifig Sláinte Áitiúil le fáil amach faoi na seirbhísí i do cheantar

source: You also can be referred for speech and language therapy by your GP or public health nurse
ga: Is féidir le do GP nó d’altra sláinte poiblí tú a tharchur do theirpe urlabhar agus teanga freisin

source: Speech and language therapists are regulated by CORU which has opened a register of therapists
ga: Rialaíonn CORU teiripeoirí urlabhra agus teanga, a bhfuil liosta de theiripeoirí cláraithe acu

source: All practising Speech and Language Therapists must apply for registration before 31 October 2016
ga: Ní foláir do gach Teiripeoir Urlabhra agus Teanga atá i mbun cleachtaidh iarratas a dhéanamh dá gclárú roimh 31 Deireadh Fómhair 2016

source: The following voluntary and professional organisations can give you advice and information on speech and language therapy services in Ireland
ga: Féadfaidh na heagraíochtaí deonacha agus gairmiúla seo a leanas comhairle agus eolas a thabhairt duit faoi na seirbhísí teiripe urlabhra agus teanga in Éirinn

source: The Irish Association of Speech and Language Therapists (IASLT) is the professional association of speech and language therapists in Ireland
ga: Is iad Cumann na hÉireann um Theiripeoirí Urlabhra agus Teanga (IASLT) an comhlacht gairmiúil de theiripeoirí urlabhra agus teanga in Éirinn

source: It provides some useful factsheets online about common speech and language disorders. Further information is available from:
ga: Cuireann siad roinnt bileoga fíricí áisiúla ar fáil faoi neamhoird rialta urlabhra agus teanga
